<a href="https://colab.research.google.com/github/HIsu1231/AI_INOVATION_SQUARE/blob/master/Kaggle_Titanic_Data_Preprocessing_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
train_df = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/titanic_data/train.csv')
test_df = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/titanic_data/test.csv')
test_sub_df = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/titanic_data/gender_submission.csv')

###train 데이터 전처리

In [3]:
train_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [4]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
train_df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [6]:
train_df['Age'].fillna(train_df['Age'].median(),inplace=True)
train_df['Embarked'].fillna('S', inplace=True)

train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

###test 데이터 전처리

In [7]:
test_sub_df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [8]:
test_df.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [9]:
test_df['Survived'] = test_sub_df['Survived']

test_df.head()

   PassengerId  Pclass  ... Embarked Survived
0          892       3  ...        Q        0
1          893       3  ...        S        1
2          894       2  ...        Q        0
3          895       3  ...        S        0
4          896       3  ...        S        1

[5 rows x 12 columns]

In [10]:
test_df = test_df[['PassengerId','Survived','Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']]
test_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S

[5 rows x 12 columns]

In [11]:
test_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [12]:
test_df['Age'].fillna(test_df['Age'].median(), inplace=True)
test_df['Fare'].fillna(test_df['Fare'].mean(), inplace=True)

test_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

###matrix로 변환

In [14]:
train_csv_data = train_df.values
test_csv_data = test_df.values

print(type(train_csv_data), train_csv_data.shape)
print(type(test_csv_data), test_csv_data.shape)

<class 'numpy.ndarray'> (891, 12)
<class 'numpy.ndarray'> (418, 12)

###문자 -> 숫자

In [15]:
#male -> 1, female -> 0

for i in range(len(train_csv_data)):
    if train_csv_data[i,4] == 'male':
        train_csv_data[i,4] = 1.0
    else:
        train_csv_data[i,4] = 0.0

for i in range(len(test_csv_data)):
    if test_csv_data[i,4] == 'male':
        test_csv_data[i,4] = 1.0
    else:
        test_csv_data[i,4] = 0.0

In [16]:
#Empty -> 0, S -> 1, C -> 2, Q -> 3

for i in range(len(train_csv_data)):
    if train_csv_data[i,11] == 'S':
        train_csv_data[i,11] = 1.0

    elif train_csv_data[i,11] == 'C':
        train_csv_data[i,11] = 2.0

    elif train_csv_data[i,11] == 'Q':
        train_csv_data[i,11] = 3.0

for i in range(len(test_csv_data)):
    if test_csv_data[i,11] == 'S':
        test_csv_data[i,11] = 1.0

    elif test_csv_data[i,11] == 'C':
        test_csv_data[i,11] = 2.0

    elif test_csv_data[i,11] =='Q':
        test_csv_data[i,11] = 3.0

###training data 생성

In [17]:
train_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [19]:
training_input_data = train_csv_data[:, [2,4,5,6,7,9]].astype('float32')
training_target_data =train_csv_data[:, 1:2].astype('float32')

print("training_input_data.shape = ", training_input_data.shape, ", training_target_data.shape = ",training_target_data.shape)

print(training_input_data[1])
print(training_target_data[1])

training_input_data.shape =  (891, 6) , training_target_data.shape =  (891, 1)
[ 1.      0.     38.      1.      0.     71.2833]
[1.]

###test data 생성

In [21]:
test_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S

[5 rows x 12 columns]

In [22]:
test_input_data = test_csv_data[:, [2, 4, 5, 6, 7, 9]].astype('float32')
test_target_data = test_csv_data[:, 1:2].astype('float32')

print("test_input_data.shape = ",test_input_data.shape, ", test_target_data.shape = ", test_target_data.shape)

print(test_input_data[1])
print(test_target_data[1])

test_input_data.shape =  (418, 6) , test_target_data.shape =  (418, 1)
[ 3.  0. 47.  1.  0.  7.]
[1.]